In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}

In [5]:
dict1

{'Names': ['sai', 'reddy', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['hyd', 'blr', 'chennai', nan]}

In [7]:
d1=pd.DataFrame(dict1)

In [8]:
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [12]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [14]:
dict2={'Names':['sai','reddy',None,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',None]}

In [16]:
d2=pd.DataFrame(dict2)

In [17]:
d2

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2   None  32.0  chennai
3   Siri  43.0     None

In [18]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [19]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [28]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan:not a number this applicable for numerical columns only

- generally data has some empty rows
- it is a data problem
- if you read that kind of data you will see null
- you need to understand it is a data  corrupted or really null values are there

**METHOD-1**
**Fill with some random values**

**method1:fillna**

In [29]:
d1.fillna(40)

   Names   Age     City
0    sai  40.0      hyd
1  reddy  21.0      blr
2     40  32.0  chennai
3   Siri  43.0       40

**method2:**
- we can fill values wrt columns also

In [33]:
d1['Age'].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [34]:
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [35]:
#here is not updated because inpalce is false
#so we need to keep inplace=True

In [36]:
d1['Age'].fillna(40,inplace=True)

In [37]:
d1

   Names   Age     City
0    sai  40.0      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [39]:
d1['Names'].fillna('kiran',inplace=True)

In [40]:
d1

   Names   Age     City
0    sai  40.0      hyd
1  reddy  21.0      blr
2  kiran  32.0  chennai
3   Siri  43.0      NaN

**METHOD-3**
- bfill
- ffill
- pad
- backfill

In [41]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)

In [42]:
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [44]:
d1.fillna(method='bfill')
#it will fill with below value or next value

C:\Users\dugge\AppData\Local\Temp\ipykernel_7280\193395722.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

   Names   Age     City
0    sai  21.0      hyd
1  reddy  21.0      blr
2   Siri  32.0  chennai
3   Siri  43.0      NaN

In [45]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [46]:
d1.fillna(method='ffill')

C:\Users\dugge\AppData\Local\Temp\ipykernel_7280\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2  reddy  32.0  chennai
3   Siri  43.0  chennai

In [49]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [50]:
d1.fillna(method='ffill',axis=0)

C:\Users\dugge\AppData\Local\Temp\ipykernel_7280\3522307913.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=0)

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2  reddy  32.0  chennai
3   Siri  43.0  chennai

In [47]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [48]:
d1.fillna(method='pad')

C:\Users\dugge\AppData\Local\Temp\ipykernel_7280\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2  reddy  32.0  chennai
3   Siri  43.0  chennai

- back fill and bfill fill with next value
- pad and ffill fill with previous value
- but it will change based on axis

**METHOD-4**
**MEAN,MEDIAN,MODE**

- MEAN
   - numerical values can fill with mean value
   - but mean gets affected by mean
   - if we dont have outliers it is best one
- MEDIAN
   - numerical values can fill  with median
   - wkt median values not affected by outliers
   - so if outliers are there we can go with median
- MODE
   - mode is useful for categorical data

In [51]:
dict1={'Names':['sai','reddy',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['hyd','blr','chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

In [52]:
#we alredy know wecan fill with some values based on specific functions
#d1.fill(<random number>)
#d1 represents all the columns
age_mean=d1['Age'].mean()
d1.fillna(age_mean)

   Names   Age     City
0    sai  32.0      hyd
1  reddy  21.0      blr
2   32.0  32.0  chennai
3   Siri  43.0     32.0

In [55]:
age_median=d1['Age'].median()
d1.fillna(age_median)

   Names   Age     City
0    sai  32.0      hyd
1  reddy  21.0      blr
2   32.0  32.0  chennai
3   Siri  43.0     32.0

In [54]:
age_mode=d1['Age'].mode()
d1.fillna(age_mode)

   Names   Age     City
0    sai   NaN      hyd
1  reddy  21.0      blr
2    NaN  32.0  chennai
3   Siri  43.0      NaN

**METHOD-5**
**KNN imputer**

- knn:k nearest neighbour
- k is a hyper parameter means,user can chose
- it is distance metric:**Euclidean distance**
- knn imputer will take the mean of neighbour value
- the neighbours value can provided by using value=k
- this is under sklearn package
- under sklearn we have imputer method
- under imputer method we have knn imputer
- it is applicable for numerical data

In [57]:
from sklearn.impute import KNNImputer
KI=KNNImputer()

KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])